# FPenPatN

## Description
Function FPenPatN returns the active pen pattern setting.

```pascal
FUNCTION FPenPatN : LONGINT;
```

```python

def vs.FPenPatN():
    return LONGINT
```

## See Also
VS Functions:
PenPatN

## Version
Availability: from Vectorworks 2013
## Category
* Document Attributes